userApp/app/controllers/user_controller.rb

SELECT "users".* FROM "users"
---
  def index

    @user_list = User.all

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "ghgh"], ["password", "[FILTERED]"], ["created_at", "2023-06-24 03:59:50.876508"], ["updated_at", "2023-06-24 03:59:50.876508"]]
---
  def create

    @user = User.new(user_param)

    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def destroy

    @user = user_find

    if @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def user_find
  @user = User.find(params[:id])